#!/usr/bin/env python3
"""
🎯 ДЕМОНСТРАЦИЯ ПРОФЕССИОНАЛЬНОЙ LLM СИСТЕМЫ
Полный пример интеграции и использования
"""

from llm_api import LLMAPIClient, quick_process, compare_responses
from professional_llm_system import ContentType
import time


def print_banner(title: str, width: int = 80):
    """Вывести красивый баннер"""
    print("\n" + "=" * width)
    print(f"🎯 {title}")
    print("=" * width + "\n")


def demo_your_original_problem():
    """Демонстрация оригинальной проблемы"""
    print_banner("ОРИГИНАЛЬНАЯ ПРОБЛЕМА: ПОВТОРЕНИЯ В LLM ОТВЕТЕ")
    
    your_llm_response = """Какие документы нужны для регистрации ООО?

06:56

1. Подготовка учредительных документов и устава ООО

Здравствуйте! Давайте разберемся, какие документы нужны для регистрации ООО (Общества с ограниченной ответственностью) и как их подготовить.

Какие документы нужны?

Заявление о регистрации: Это специальная форма, которую нужно заполнить. Она называется "Форма Р11001". В ней указываются основные сведения об ООО, такие как название, адрес и данные учредителей.

Устав ООО: Это главный документ компании, где прописаны все правила её работы. Устав должен содержать информацию о целях компании, размерах уставного капитала и правах участников.

Протокол собрания учредителей: Если в ООО несколько учредителей, они должны провести собрание и принять решение о создании компании. Итоги оформляются в протоколе.

Квитанция об оплате госпошлины: За регистрацию ООО нужно заплатить госпошлину. Её размер можно узнать на сайте налоговой службы.

Гарантийное письмо от владельца помещения: Если вы арендуете офис или другое помещение, вам нужно получить письмо от арендодателя, что он не против размещения вашей компании по этому адресу.

2. Сбор и оформление заявления о государственной регистрации

Конечно, давайте разберемся, какие документы нужны для регистрации ООО и как их правильно оформить.

Заявление о регистрации: Это самый важный документ. В нем указываются основные сведения о вашей будущей компании: название, адрес, виды деятельности.

Устав компании: Это как правила игры для вашей компании. В нем прописываются цели, задачи, внутренние правила.

3. Оплата государственной пошлины и подтверждение адреса ООО

Конечно! Давайте разберемся, какие документы вам понадобятся для регистрации ООО.

Заявление о регистрации: Это основной документ, в котором вы указываете информацию о вашем будущем ООО.

Устав ООО: Это документ, который описывает внутренние правила работы вашей компании.

Риски

Если не оплатить пошлину или неправильно указать реквизиты, регистрация может быть отклонена."""
    
    print("❌ ПРОБЛЕМА: Документ полон повторений!")
    print(f"\n📊 Размер оригинального текста: {len(your_llm_response):,} символов")
    
    # Обработать
    result = quick_process(your_llm_response, title="Регистрация ООО")
    
    print(f"\n✅ РЕШЕНИЕ ПРИМЕНЕНО!")
    compare_responses(your_llm_response, result)
    
    print("\n📄 ОЧИЩЕННЫЙ ТЕКСТ:")
    print("-" * 80)
    print(result.markdown)
    
    print("\n\n💡 РЕЗЮМЕ:")
    print(result.summary)


def demo_basic_usage():
    """Демонстрация базового использования"""
    print_banner("1. БАЗОВОЕ ИСПОЛЬЗОВАНИЕ (1 строка кода)")
    
    text = """
    Python - это язык программирования. Python используется везде. Python популярен.
    Почему Python популярен? Потому что Python легко учится. Python имеет библиотеку.
    Python используется в науке. Python используется в веб-разработке.
    """
    
    result = quick_process(text, "Python для начинающих")
    
    print("Код:")
    print("  result = quick_process(text, title)")
    print("\n✅ Результат:")
    print(result.markdown[:500] + "...")
    print("\n📊 Статистика:")
    result.print_statistics()


def demo_advanced_usage():
    """Демонстрация продвинутого использования"""
    print_banner("2. ПРОДВИНУТОЕ ИСПОЛЬЗОВАНИЕ (С НАСТРОЙКАМИ)")
    
    text = """
    Веб-безопасность важна. Веб-безопасность защищает данные. 
    Используйте HTTPS. HTTPS шифрует данные.
    Опасность фишинга высока. Фишинг - это когда злоумышленник выдает себя за легитимный сайт.
    """
    
    # Создать клиент с кастомными настройками
    client = LLMAPIClient(
        max_length=1000,
        similarity_threshold=0.75,
        verbose=True
    )
    
    print("Код:")
    print("""
    client = LLMAPIClient(
        max_length=1000,
        similarity_threshold=0.75,
        verbose=True
    )
    result = client.process(text)
    """)
    
    print("\n⏳ Обработка...")
    result = client.process(text, title="Web Security")
    
    print("\n✅ Результат:")
    print(result.markdown[:400] + "...")


def demo_multiple_formats():
    """Демонстрация экспорта в разные форматы"""
    print_banner("3. ЭКСПОРТ В РАЗНЫЕ ФОРМАТЫ")
    
    text = """
    React - это библиотека JavaScript. React используется для UI. React компоненты.
    Компоненты React переиспользуемые. Компоненты состояния имеют состояние.
    """
    
    result = quick_process(text, "React Basics")
    
    print("📄 MARKDOWN:")
    print(result.markdown[:300] + "...\n")
    
    print("📊 JSON (первые поля):")
    import json
    json_str = json.dumps(result.json, ensure_ascii=False, indent=2)
    print(json_str[:300] + "...\n")
    
    print("📝 PLAINTEXT:")
    print(result.plaintext[:300] + "...\n")
    
    print("📌 SUMMARY:")
    print(result.summary[:200] + "...")


def demo_content_filtering():
    """Демонстрация фильтрации по типам контента"""
    print_banner("4. ФИЛЬТРАЦИЯ ПО ТИПАМ КОНТЕНТА")
    
    text = """
    Что такое MySQL? MySQL это база данных.
    
    Как установить MySQL? Загрузите установщик и запустите его.
    
    Пример подключения: connection = mysql.connector.connect(host="localhost")
    
    Внимание! Защищайте пароли базы данных.
    
    Риск утечки данных очень высок при неправильной конфигурации.
    """
    
    result = quick_process(text, "MySQL Tutorial")
    
    print("📋 ВСЕ БЛОКИ:")
    for i, chunk in enumerate(result.chunks, 1):
        print(f"  {i}. [{chunk.type.value}] {chunk.title}")
    
    print("\n\n⚠️ ТОЛЬКО ПРЕДУПРЕЖДЕНИЯ И РИСКИ:")
    warnings = result.get_by_type(ContentType.WARNING)
    risks = result.get_by_type(ContentType.RISK)
    
    for warning in warnings:
        print(f"  ⚠️  {warning.content[:70]}...")
    
    for risk in risks:
        print(f"  🚨 {risk.content[:70]}...")
    
    print("\n\n📝 ТОЛЬКО ИНСТРУКЦИИ:")
    instructions = result.get_by_type(ContentType.INSTRUCTION)
    for instruction in instructions:
        print(f"  → {instruction.content[:70]}...")


def demo_batch_processing():
    """Демонстрация пакетной обработки"""
    print_banner("5. ПАКЕТНАЯ ОБРАБОТКА")
    
    documents = [
        {
            'title': 'Docker Introduction',
            'content': '''
            Docker это контейнерная платформа. Docker изолирует приложения.
            Docker контейнеры легкие. Docker контейнеры быстрые.
            Используйте Docker для миграции. Docker упрощает развертывание.
            '''
        },
        {
            'title': 'Kubernetes Guide',
            'content': '''
            Kubernetes это оркестратор контейнеров. Kubernetes управляет масштабированием.
            Pod - это основная единица в Kubernetes. Pod содержит контейнеры.
            Service в Kubernetes предоставляет доступ. Service балансирует нагрузку.
            '''
        },
        {
            'title': 'CI/CD Best Practices',
            'content': '''
            CI/CD это непрерывная интеграция. CI/CD автоматизирует тесты.
            Pipeline должен быть быстрым. Pipeline должен быть надежным.
            Используйте GitLab CI или GitHub Actions.
            '''
        }
    ]
    
    client = LLMAPIClient(verbose=False)
    
    print(f"Обработка {len(documents)} документов...\n")
    start = time.time()
    
    results = client.process_batch(documents)
    
    elapsed = time.time() - start
    
    print(f"✅ Обработано за {elapsed:.2f} секунд\n")
    
    for i, result in enumerate(results, 1):
        print(f"Документ {i}: {result._response.metadata['title']}")
        print(f"  • Оригинальная длина: {result.statistics['original_length']:,}")
        print(f"  • Оптимизированная: {result.statistics['optimized_length']:,}")
        print(f"  • Сжатие: {result.statistics['compression_ratio']:.1%}")
        print(f"  • Качество: {result.statistics['quality_score']:.1%}\n")


def demo_custom_handler():
    """Демонстрация кастомного обработчика"""
    print_banner("6. КАСТОМНЫЙ ОБРАБОТЧИК")
    
    text = """
    Что делать? Прочитайте инструкции. Следуйте шагам.
    Опасность! Неправильное использование опасно. Осторожно с деталями!
    Пример: вот как это работает. Смотрите примеры.
    """
    
    def boost_dangers(response):
        """Кастомный обработчик: усилить опасности"""
        print("\n🔧 Применяем кастомный обработчик...\n")
        
        for chunk in response.chunks:
            if chunk.type in [ContentType.WARNING, ContentType.RISK]:
                old_importance = chunk.importance
                chunk.importance = 1.0
                print(f"  • {chunk.type.value}: {old_importance:.0%} → {chunk.importance:.0%}")
        
        return response
    
    client = LLMAPIClient()
    result = client.process(text, custom_handler=boost_dangers)
    
    print("\nРезультат:")
    print(result.markdown)


def demo_comparison():
    """Демонстрация сравнения"""
    print_banner("7. СРАВНЕНИЕ ОРИГИНАЛЬНОГО И ОБРАБОТАННОГО")
    
    text = """
    Как выбрать ноутбук? Сначала решите бюджет. Как выбрать ноутбук хорошо?
    Выбирайте процессор AMD или Intel. Выбирайте достаточно памяти RAM.
    Как выбрать экран? Экран должен быть ярким. Как выбрать батарею?
    Батарея должна работать долго. Какую выбрать марку? Samsung, Dell, HP.
    """
    
    result = quick_process(text, "Laptop Buying Guide")
    compare_responses(text, result)


def demo_integration_examples():
    """Демонстрация примеров интеграции"""
    print_banner("8. ПРИМЕРЫ ИНТЕГРАЦИИ")
    
    print("""
📚 ПРИМЕРЫ ИНТЕГРАЦИИ В РАЗЛИЧНЫЕ ФРЕЙМВОРКИ:

1️⃣ FLASK:
   from llm_api import LLMAPIClient
   client = LLMAPIClient()
   
   @app.route('/api/process', methods=['POST'])
   def process():
       text = request.json['text']
       result = client.process(text)
       return jsonify({'markdown': result.markdown})

2️⃣ DJANGO:
   from llm_api import LLMAPIClient
   
   def process_view(request):
       text = request.POST['text']
       result = LLMAPIClient().process(text)
       return JsonResponse({'markdown': result.markdown})

3️⃣ FASTAPI:
   from llm_api import LLMAPIClient
   
   @app.post("/api/process")
   async def process(request: ProcessRequest):
       result = LLMAPIClient().process(request.text)
       return {"markdown": result.markdown}

4️⃣ TELEGRAM BOT:
   from llm_api import quick_process
   
   @bot.message_handler(content_types=['text'])
   def handle_message(message):
       result = quick_process(message.text)
       bot.send_message(message.chat.id, result.markdown)

5️⃣ DISCORD BOT:
   from llm_api import quick_process
   
   @bot.command()
   async def process_llm(ctx, *, text):
       result = quick_process(text)
       await ctx.send(result.summary)

📖 Подробные примеры смотрите в:
   • INTEGRATION_GUIDE.md - полное руководство интеграции
   • example_usage.py - 7 практических примеров
    """)


def main():
    """Главное меню демонстрации"""
    print("\n" + "█" * 80)
    print("█" + " " * 78 + "█")
    print("█" + "  🎯 ПРОФЕССИОНАЛЬНАЯ СИСТЕМА ОБРАБОТКИ LLM ОТВЕТОВ".center(78) + "█")
    print("█" + " " * 78 + "█")
    print("█" * 80)
    
    demos = [
        ("🔴 ОРИГИНАЛЬНАЯ ПРОБЛЕМА (ваш пример)", demo_your_original_problem),
        ("🟢 1. БАЗОВОЕ ИСПОЛЬЗОВАНИЕ", demo_basic_usage),
        ("🟡 2. ПРОДВИНУТОЕ ИСПОЛЬЗОВАНИЕ", demo_advanced_usage),
        ("🔵 3. ЭКСПОРТ В ФОРМАТЫ", demo_multiple_formats),
        ("🟣 4. ФИЛЬТРАЦИЯ ПО ТИПАМ", demo_content_filtering),
        ("🟠 5. ПАКЕТНАЯ ОБРАБОТКА", demo_batch_processing),
        ("🟤 6. КАСТОМНЫЙ ОБРАБОТЧИК", demo_custom_handler),
        ("⚫ 7. СРАВНЕНИЕ РЕЗУЛЬТАТОВ", demo_comparison),
        ("⚪ 8. ПРИМЕРЫ ИНТЕГРАЦИИ", demo_integration_examples),
    ]
    
    print("\nВыберите демонстрацию:")
    for i, (name, _) in enumerate(demos, 1):
        print(f"  {i}. {name}")
    print("  0. Запустить все")
    print("  Q. Выход")
    
    while True:
        choice = input("\nВводите номер (0-9, Q): ").strip().upper()
        
        if choice == 'Q':
            print("\n👋 До встречи!")
            break
        elif choice == '0':
            print("\n" + "=" * 80)
            print("🚀 ЗАПУСК ПОЛНОЙ ДЕМОНСТРАЦИИ")
            print("=" * 80)
            for i, (name, func) in enumerate(demos, 1):
                try:
                    func()
                    input(f"\n[Нажмите Enter для продолжения...]")
                except Exception as e:
                    print(f"\n❌ Ошибка: {e}")
            
            print("\n" + "=" * 80)
            print("✅ ДЕМОНСТРАЦИЯ ЗАВЕРШЕНА")
            print("=" * 80)
            break
        elif choice.isdigit() and 1 <= int(choice) <= len(demos):
            idx = int(choice) - 1
            name, func = demos[idx]
            try:
                func()
            except Exception as e:
                print(f"\n❌ Ошибка: {e}")
                import traceback
                traceback.print_exc()
        else:
            print("❌ Неверный выбор")


if __name__ == "__main__":
    try:
        main()
    except KeyboardInterrupt:
        print("\n\n👋 Прервано пользователем")
    except Exception as e:
        print(f"\n\n❌ Ошибка: {e}")
        import traceback
        traceback.print_exc()

